{"config": [{"config": {"padding": "valid", "filters": 32, "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3], "name": "conv2d_1", "dtype": "float32", "dilation_rate": [1, 1], "batch_input_shape": [null, 300, 300, 3], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "relu", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform", "dtype": "float32"}, "class_name": "VarianceScaling"}, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "name": "max_pooling2d_1", "data_format": "channels_last", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "dtype": "float32"}, "class_name": "MaxPooling2D"}, {"config": {"padding": "valid", "filters": 32, "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3], "name": "conv2d_2", "dtype": "float32", "dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "relu", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform", "dtype": "float32"}, "class_name": "VarianceScaling"}, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "name": "max_pooling2d_2", "data_format": "channels_last", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "dtype": "float32"}, "class_name": "MaxPooling2D"}, {"config": {"padding": "valid", "filters": 64, "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3], "name": "conv2d_3", "dtype": "float32", "dilation_rate": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "relu", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform", "dtype": "float32"}, "class_name": "VarianceScaling"}, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "name": "max_pooling2d_3", "data_format": "channels_last", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "dtype": "float32"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true, "dtype": "float32"}, "class_name": "Flatten"}, {"config": {"kernel_regularizer": null, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "units": 64, "name": "dense_1", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "relu", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform", "dtype": "float32"}, "class_name": "VarianceScaling"}, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "dtype": "float32"}, "class_name": "Dense"}, {"config": {"name": "dropout_1", "rate": 0.8, "noise_shape": null, "trainable": true, "seed": null, "dtype": "float32"}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "units": 3, "name": "dense_2", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "softmax", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform", "dtype": "float32"}, "class_name": "VarianceScaling"}, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "dtype": "float32"}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.5-tf"}