{"config": [{"config": {"trainable": true, "dtype": "float32", "kernel_regularizer": null, "batch_input_shape": [null, 300, 300, 3], "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "dtype": "float32"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_size": [3, 3], "padding": "valid", "name": "conv2d_1", "bias_regularizer": null, "activation": "relu", "dilation_rate": [1, 1], "use_bias": true, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "bias_constraint": null, "filters": 32}, "class_name": "Conv2D"}, {"config": {"trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "padding": "valid", "name": "max_pooling2d_1", "dtype": "float32"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "dtype": "float32", "kernel_size": [3, 3], "data_format": "channels_last", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "dtype": "float32"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "name": "conv2d_2", "padding": "valid", "activation": "relu", "dilation_rate": [1, 1], "use_bias": true, "kernel_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "bias_constraint": null, "filters": 32}, "class_name": "Conv2D"}, {"config": {"trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "padding": "valid", "name": "max_pooling2d_2", "dtype": "float32"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "dtype": "float32", "kernel_size": [3, 3], "data_format": "channels_last", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "dtype": "float32"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "name": "conv2d_3", "padding": "valid", "activation": "relu", "dilation_rate": [1, 1], "use_bias": true, "kernel_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "bias_constraint": null, "filters": 64}, "class_name": "Conv2D"}, {"config": {"trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "padding": "valid", "name": "max_pooling2d_3", "dtype": "float32"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1", "dtype": "float32"}, "class_name": "Flatten"}, {"config": {"trainable": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "dtype": "float32"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null, "name": "dense_1", "dtype": "float32", "activation": "relu", "units": 64, "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"seed": null, "trainable": true, "noise_shape": null, "rate": 0.8, "name": "dropout_1", "dtype": "float32"}, "class_name": "Dropout"}, {"config": {"trainable": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "dtype": "float32"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null, "name": "dense_2", "dtype": "float32", "activation": "softmax", "units": 3, "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "use_bias": true}, "class_name": "Dense"}], "backend": "tensorflow", "keras_version": "2.1.5-tf", "class_name": "Sequential"}