{"keras_version": "2.1.5-tf", "backend": "tensorflow", "config": [{"config": {"kernel_constraint": null, "kernel_initializer": {"config": {"dtype": "float32", "scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "name": "conv2d_1", "bias_constraint": null, "kernel_size": [3, 3], "activation": "linear", "dilation_rate": [1, 1], "trainable": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "filters": 32, "bias_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "use_bias": true, "padding": "valid", "strides": [1, 1], "dtype": "float32", "batch_input_shape": [null, 300, 300, 3]}, "class_name": "Conv2D"}, {"config": {"dtype": "float32", "activation": "relu", "name": "activation_1", "trainable": true}, "class_name": "Activation"}, {"config": {"padding": "valid", "name": "max_pooling2d_1", "data_format": "channels_last", "dtype": "float32", "pool_size": [2, 2], "strides": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"kernel_constraint": null, "kernel_initializer": {"config": {"dtype": "float32", "scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "name": "conv2d_2", "bias_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "dilation_rate": [1, 1], "trainable": true, "filters": 32, "bias_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "use_bias": true, "padding": "valid", "strides": [1, 1], "dtype": "float32", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"dtype": "float32", "activation": "relu", "name": "activation_2", "trainable": true}, "class_name": "Activation"}, {"config": {"padding": "valid", "name": "max_pooling2d_2", "data_format": "channels_last", "dtype": "float32", "pool_size": [2, 2], "strides": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"kernel_constraint": null, "kernel_initializer": {"config": {"dtype": "float32", "scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "name": "conv2d_3", "bias_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "dilation_rate": [1, 1], "trainable": true, "filters": 64, "bias_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "use_bias": true, "padding": "valid", "strides": [1, 1], "dtype": "float32", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"dtype": "float32", "activation": "relu", "name": "activation_3", "trainable": true}, "class_name": "Activation"}, {"config": {"padding": "valid", "name": "max_pooling2d_3", "data_format": "channels_last", "dtype": "float32", "pool_size": [2, 2], "strides": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"dtype": "float32", "name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"kernel_constraint": null, "kernel_initializer": {"config": {"dtype": "float32", "scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "name": "dense_1", "bias_constraint": null, "activity_regularizer": null, "activation": "linear", "units": 64, "trainable": true, "bias_regularizer": null, "dtype": "float32", "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"name": "dropout_1", "rate": 0.8, "dtype": "float32", "seed": null, "noise_shape": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "kernel_initializer": {"config": {"dtype": "float32", "scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "name": "dense_2", "bias_constraint": null, "activity_regularizer": null, "activation": "softmax", "units": 3, "trainable": true, "bias_regularizer": null, "dtype": "float32", "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Dense"}], "class_name": "Sequential"}